#-*- mode: org -*-

#+TITLE=Main config file
#+STARTUP:overview

(What the world needs (I think) is not
      (a Lisp (with fewer parentheses))
      but (an English (with more.)))
-- Brian Hayes, http://tinyurl.com/3y9l2kf

 Emacs is a flexible platform for developing end-user applications
   –unfortunately it is generally perceived as merely a text editor.
Some people use it specifically for one or two applications.
   https://alhassy.github.io/init/

I’m rarely happier than when spending an entire day programming my computer
  to perform automatically a task that would otherwise take me a
  good ten seconds to do by hand.
-- Douglas Adams

**** Creat it when starting Emacs
#+BEGIN_SRC elisp
  (defun brust-create-english-word-file nil
    (let ((p nil))
      (with-temp-buffer
        (when (file-exists-p "~/Dropbox/config/english-words-saved.txt")
          (insert-file-contents "~/Dropbox/config/english-words-saved.txt")
          (end-of-buffer)
          (setq p t))
        (when (file-exists-p "~/Dropbox/config/personal-words.txt")
          (insert-file-contents "~/Dropbox/config/personal-words.txt")
          (setq p t))
        (when p
          (write-file "~/.doom.d/local/english-words.txt")))))

  (add-hook 'emacs-startup-hook #'brust-create-english-word-file)
#+END_SRC

#+RESULTS:
| brust-create-english-word-file | brust-init-files |
*** Set Monoid font family.
#+BEGIN_SRC elisp
  (when (member "IBM Plex Mono" (font-family-list))
    (set-frame-font "IBM Plex Mono Light 13")
    (add-to-list 'initial-frame-alist '(font . "IBM Plex Mono Light"))
    (add-to-list 'default-frame-alist '(font . "IBM Plex Mono Light")))
#+END_SRC

#+RESULTS:
: ((font . IBM Plex Mono Light) (right-divider-width . 1) (bottom-divider-width . 1) (font . -*-monospace-*-*-*-*-14-*-*-*-*-*-*-*) (vertical-scroll-bars) (tool-bar-lines . 0) (menu-bar-lines . 0))

*** Formater
#+begin_src elisp
(setq +format-on-save-enabled-modes
      '(not emacs-lisp-mode  ; elisp's mechanisms are good enough
            sql-mode         ; sqlformat is currently broken
            tex-mode         ; latexindent is broken
            c-mode
            latex-mode))
#+end_src

#+RESULTS:
| not | emacs-lisp-mode | sql-mode | tex-mode | c-mode | latex-mode |

*** Lookup online
- Thresauros for synonyms.
#+begin_src elisp
(setq +lookup-provider-url-alist
      '(;; ("Doom Emacs issues" "https://github.com/hlissner/doom-emacs/issues?q=is%%3Aissue+%s")
        ("Google"            +lookup--online-backend-google "https://google.com/search?q=%s")
        ("Wikipedia"         "https://wikipedia.org/search-redirect.php?language=en&go=Go&search=%s")
        ("Singular Manual"   "https://www.google.com/search?q=site:www.singular.uni-kl.de+%s")
        ("Project Gutenberg" "http://www.gutenberg.org/ebooks/search/?query=%s")
        ;; ("DuckDuckGo"        +lookup--online-backend-duckduckgo "https://duckduckgo.com/?q=%s")
        ("DevDocs.io"        "https://devdocs.io/#q=%s")
        ("StackOverflow"     "https://stackoverflow.com/search?q=%s")
        ;; ("Github"            "https://github.com/search?ref=simplesearch&q=%s")
        ("Youtube"           "https://youtube.com/results?aq=f&oq=&search_query=%s")
        ;; ("Wolfram alpha"     "https://wolframalpha.com/input/?i=%s")
        ("Google images"     "https://www.google.com/images?q=%s")
        ("Google maps"       "https://maps.google.com/maps?q=%s")
        ))
#+end_src

#+RESULTS:
| Google            | +lookup--online-backend-google                                        | https://google.com/search?q=%s |
| Wikipedia         | https://wikipedia.org/search-redirect.php?language=en&go=Go&search=%s |                                |
| Singular Manual   | https://www.google.com/search?q=site:www.singular.uni-kl.de+%s        |                                |
| Project Gutenberg | http://www.gutenberg.org/ebooks/search/?query=%s                      |                                |
| DevDocs.io        | https://devdocs.io/#q=%s                                              |                                |
| StackOverflow     | https://stackoverflow.com/search?q=%s                                 |                                |
| Youtube           | https://youtube.com/results?aq=f&oq=&search_query=%s                  |                                |
| Google images     | https://www.google.com/images?q=%s                                    |                                |
| Google maps       | https://maps.google.com/maps?q=%s                                     |                                |

** Bindings
#+begin_src elisp
(map!
 ;; s- commands: commands executed several times AND in several distinct modes.
 "s-s"      #'save-buffer
 "s-w"      #'evil-window-next
 "s-c"      #'close-quoted-open-paren-right-or-left
 ;; "s-SPC"    #'brust-cycle-whitespace ;; Use it once I am used to 'g SPC'
 "s-h"      #'recenter-top-bottom
 ;; "s-f"      #'flyspell-correct-previous ;; Learning to use z=
 ;; s- motion command
 "s-j"      #'evil-scroll-down
 "s-k"      #'evil-scroll-up
 ;; Cycling in kill-ring
 "C-P"      #'brust-evil-paste-pop-backwards
 "M-p"      #'counsel-yank-pop
 ;; :ier "M-i" #'evil-normal-state ;; it was tab-to-tab-stop
 ;; Now I use evil-escape (equivalent to key-chords jk kj) Press them a single key!

 ;; Normal mode workarounds (keep it to minimum)
 ;; :n "u"     #'emacs-undo ;; now undo works fine
 :nim "C-e" #'doom/forward-to-last-non-comment-or-eol
 :n "Q"     #'evil-delete-buffer
 :n "q"     #'brust-kill-buffer
 :nvmro "w" #'evil-backward-word-begin
 :nvmro "W" #'evil-backward-WORD-begin
 ;; :n "H"     #'recenter-top-bottom ;; There is no difference with s-h
 ;; More handy TABs (From Hlissner)
 :n [tab] (general-predicate-dispatch nil
            (fboundp 'evil-jump-item)
            #'evil-jump-item)

 :v [tab] (general-predicate-dispatch nil
            (and (bound-and-true-p yas-minor-mode)
                 (or (eq evil-visual-selection 'line)
                     (not (memq (char-after) (list ?\( ?\[ ?\{ ?\} ?\] ?\))))))
            #'yas-insert-snippet
            (fboundp 'evil-jump-item)
            #'evil-jump-item)

 ;; Personal extensions
 "<f9>"     #'mu4e
 "<f10>"    #'magit-status
 "<f5>"     #'counsel-kmacro
 :n "g SPC" #'brust-cycle-whitespace ;; It was unbind
 (:prefix "z"
  :n "j" #'+spell/next-error
  :n "k" #'+spell/previous-error)
 (:leader
  :desc "locleader" "SPC" nil ;; Unbind "SPC SPC"
  :desc "Delete other windows" "w 0" #'delete-other-windows
  :desc "Rotate anticlockwise" "w a" #'rotate-frame-anticlockwise
  ;; :desc "Switch buffer"              "b b" #'ivy-switch-buffer

  ;; My global bindings of Laura: functions used everywhere but not so often.
  (:prefix ("l" . "BMO")
   "n"    #'endless/narrow-or-widen-dwim
   "i"    #'endless/ispell-word-then-abbrev
   ;; "%"    #'vr/replace
   "%"    #'vr/query-replace
   "<f3>" #'kmacro-query-my
   ;; Zooming in emacs
   "1"    #'zoom-out ;; enlarge font
   "2"    #'zoom-in ;; reduce font
   (:prefix ("a" . "accents")
    ;; Easy Catala i Castella
    :desc "Insert ç" "c" (lambda nil (interactive) (insert "ç"))
    :desc "Insert Ç" "C" (lambda nil (interactive) (insert "Ç"))
    :desc "Insert ñ" "n" (lambda nil (interactive) (insert "ñ"))
    :desc "Insert Ñ" "N" (lambda nil (interactive) (insert "Ñ"))
    :desc "Insert à" "a" (lambda nil (interactive) (insert "à"))
    :desc "Insert À" "A" (lambda nil (interactive) (insert "À"))
    :desc "Insert è" "e" (lambda nil (interactive) (insert "è"))
    :desc "Insert È" "E" (lambda nil (interactive) (insert "È"))
    :desc "Insert é" "r" (lambda nil (interactive) (insert "é"))
    :desc "Insert É" "R" (lambda nil (interactive) (insert "É"))
    :desc "Insert í" "i" (lambda nil (interactive) (insert "í"))
    :desc "Insert Í" "I" (lambda nil (interactive) (insert "Í"))
    :desc "Insert ï" "k" (lambda nil (interactive) (insert "ï"))
    :desc "Insert Ï" "K" (lambda nil (interactive) (insert "Ï"))
    :desc "Insert ò" "o" (lambda nil (interactive) (insert "ò"))
    :desc "Insert Ò" "O" (lambda nil (interactive) (insert "Ò"))
    :desc "Insert ó" "p" (lambda nil (interactive) (insert "ó"))
    :desc "Insert Ó" "P" (lambda nil (interactive) (insert "Ó"))
    :desc "Insert ú" "u" (lambda nil (interactive) (insert "ú"))
    :desc "Insert Ú" "U" (lambda nil (interactive) (insert "Ú"))
    :desc "Insert ü" "j" (lambda nil (interactive) (insert "ü"))
    :desc "Insert Ü" "J" (lambda nil (interactive) (insert "Ü"))
    )))
 )
#+end_src

#+RESULTS:
| lambda | nil | (interactive) | (insert Ü) |

***** Hot expand defun
#+BEGIN_SRC elisp
  (defun hot-expand (str &optional mod header)
    "Expand org block template.

    STR is a structure template string recognised by org like <s. MOD is a
    string with additional parameters to add the begin line of the
    structure element. HEADER string includes more parameters that are
    prepended to the element after the #+HEADERS: tag."
    (let ((-str (if mod (concat str " " mod) str)))
      (if (region-active-p)
          (let ((-str-region (buffer-substring (region-beginning) (region-end))))
            (when header
              (delete-region (region-beginning) (region-end))
              (deactivate-mark)
              (insert "#+HEADERS: " header "\n")
              (push-mark)
              (activate-mark t)
              (insert -str-region))
            (org-insert-structure-template -str))
        (when header (insert "#+HEADERS: " header "\n"))
        (org-insert-structure-template -str)
        (insert "\n")
        (backward-char 1))))

  ;; (setq org-structure-template-alist (eval (car (get 'org-structure-template-alist 'standard-value))))
  ;; (require 'org-tempo) ; Required from org 9 onwards for old template expansion
  ;; Reset the org-template expnsion system, this is need after upgrading to org 9 for some reason

  (defun brust-org< nil
    "Self insert command or expand hydra of org block templates
  at the beginning of a line
  or with region active."
    (interactive)
    (if (or (region-active-p) (looking-back "^"))
        (hydra-org-block-template/body)
      (self-insert-command 1)))
#+END_SRC

#+RESULTS:
: brust-org<

**** Rich
Enlarge width of some columns
#+begin_src elisp
(after! ivy
  (let* ((plist (plist-get ivy-rich-display-transformers-list 'ivy-switch-buffer))
         (switch-buffer-alist (assq 'ivy-switch-buffer-transformer (plist-get plist :columns))))
    (when switch-buffer-alist
      (setcdr switch-buffer-alist '((:width 80)))))

  (let* ((plist (plist-get ivy-rich-display-transformers-list 'counsel-M-x))
         (switch-buffer-alist (assq 'counsel-M-x-transformer (plist-get plist :columns))))
    (when switch-buffer-alist
      (setcdr switch-buffer-alist '((:width 50)))))
  )
#+end_src

#+RESULTS:
| :width | 50 |

*** Smerge
See https://github.com/alphapapa/unpackaged.el#smerge-mode

#+begin_src elisp
  (use-package! smerge-mode
    :after (hydra ediff)
    :config
    (defhydra unpackaged/smerge-hydra
      (:color pink :hint nil :post (smerge-auto-leave))
      "
  ^Move^       ^Keep^               ^Diff^                 ^Other^
  ^^-----------^^-------------------^^---------------------^^-------
  _n_ext       _b_ase               _<_: upper/base        _C_ombine
  _p_rev       _u_pper              _=_: upper/lower       _r_esolve
  ^^           _l_ower              _>_: base/lower        _k_ill current
  ^^           _a_ll                _R_efine
  ^^           _RET_: current       _E_diff
  "
      ("n" smerge-next)
      ("p" smerge-prev)
      ("b" smerge-keep-base)
      ("u" smerge-keep-upper)
      ("l" smerge-keep-lower)
      ("a" smerge-keep-all)
      ("RET" smerge-keep-current)
      ("\C-m" smerge-keep-current)
      ("<" smerge-diff-base-upper)
      ("=" smerge-diff-upper-lower)
      (">" smerge-diff-base-lower)
      ("R" smerge-refine)
      ("E" smerge-ediff)
      ("C" smerge-combine-with-next)
      ("r" smerge-resolve)
      ("k" smerge-kill-current)
      ("ZZ" (lambda ()
              (interactive)
              (save-buffer)
              (bury-buffer))
       "Save and bury buffer" :color blue)
      ("q" nil "cancel" :color blue))
    (defun modi/enable-smerge-maybe ()
      "Auto-enable `smerge-mode' when merge conflict is detected."
      (save-excursion
        (goto-char (point-min))
        (when (re-search-forward "^<<<<<<< " nil :noerror)
          (smerge-mode 1))))
    :hook (find-file-hook . modi/enable-smerge-maybe))
#+end_src

#+RESULTS:
| modi/enable-smerge-maybe |
*** Zoom
#+begin_src elisp
(use-package! zoom
  :defer t
  :init
  (setq zoom-size '(0.618 . 0.618)
        zoom-ignored-major-modes '("dired-mode"
                                   "ediff-mode"
                                   ;; "eshell-mode"
                                   ;; "neotree-mode"
                                   "sr-speedbar-mode")
        zoom-ignored-buffer-name-regexps '("^*calc" "^\\*magit: +.*"))
  (add-hook! 'emacs-startup-hook (zoom-mode +1)))

(after! ediff
  (add-hook! 'ediff-before-setup-hook (zoom-mode -1))
  (add-hook! 'ediff-cleanup-hook (zoom-mode +1))
  )
#+end_src

#+RESULTS:
| brust-zoom-on |

